# OpeningDoesnotCutHostDelete Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..OpeningDoesnotCutHostDelete Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Opening does not cut its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpeningDoesnotCutHostDelete { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpeningDoesnotCutHostDelete As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpeningDoesnotCutHostDelete {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace